betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dac.c
  /* Change DAC state */
  hdac->State = DAL_DAC_STATE_BUSY;

  /* Get the DAC CTRL value */
  tmpreg1 = hdac->Instance->CTRL;
  /* Clear BUFFDx, TRGENx, TRGSELx, WAVENx and MAMPSELx bits */
  tmpreg1 &= ~(((uint32_t)(DAC_CTRL_MAMPSELCH1 | DAC_CTRL_WAVENCH1 | DAC_CTRL_TRGSELCH1 | DAC_CTRL_TRGENCH1 | DAC_CTRL_BUFFDCH1)) << (Channel & 0x10UL));
  /* Configure for the selected DAC channel: buffer output, trigger */
  /* Set TRGSELx and TRGENx bits according to DAC_Trigger value */
  /* Set BUFFDx bit according to DAC_OutputBuffer value */
  tmpreg2 = (sConfig->DAC_Trigger | sConfig->DAC_OutputBuffer);
  /* Calculate CTRL register value depending on DAC_Channel */
  tmpreg1 |= tmpreg2 << (Channel & 0x10UL);
  /* Write to DAC CTRL */
  hdac->Instance->CTRL = tmpreg1;
  /* Disable wave generation */
  CLEAR_BIT(hdac->Instance->CTRL, (DAC_CTRL_WAVENCH1 << (Channel & 0x10UL)));

  /* Change DAC state */
  hdac->State = DAL_DAC_STATE_READY;

  /* Process unlocked */
  __DAL_UNLOCK(hdac);

  /* Return function status */
  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup DAC_Exported_Functions_Group4 Peripheral State and Errors functions
  *  @brief   Peripheral State and Errors functions
  *
@verbatim
  ==============================================================================
            ##### Peripheral State and Errors functions #####
  ==============================================================================
    [..]
    This subsection provides functions allowing to
      (+) Check the DAC state.
      (+) Check the DAC Errors.

@endverbatim
  * @{
  */

/**
  * @brief  return the DAC handle state
  * @param  hdac pointer to a DAC_HandleTypeDef structure that contains
  *         the configuration information for the specified DAC.
  * @retval DAL state
  */
DAL_DAC_StateTypeDef DAL_DAC_GetState(DAC_HandleTypeDef *hdac)
{
  /* Return DAC handle state */
  return hdac->State;
}


/**
  * @brief  Return the DAC error code
  * @param  hdac pointer to a DAC_HandleTypeDef structure that contains
  *         the configuration information for the specified DAC.
  * @retval DAC Error Code
  */
uint32_t DAL_DAC_GetError(DAC_HandleTypeDef *hdac)
{
  return hdac->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup DAC_Exported_Functions
  * @{
  */

/** @addtogroup DAC_Exported_Functions_Group1
  * @{
  */
#if (USE_DAL_DAC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User DAC Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param  hdac DAC handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_DAC_ERROR_INVALID_CALLBACK   DAC Error Callback ID
  *          @arg @ref DAL_DAC_CH1_COMPLETE_CB_ID       DAC CH1 Complete Callback ID
  *          @arg @ref DAL_DAC_CH1_HALF_COMPLETE_CB_ID  DAC CH1 Half Complete Callback ID
  *          @arg @ref DAL_DAC_CH1_ERROR_ID             DAC CH1 Error Callback ID
  *          @arg @ref DAL_DAC_CH1_UNDERRUN_CB_ID       DAC CH1 UnderRun Callback ID
  *          @arg @ref DAL_DAC_CH2_COMPLETE_CB_ID       DAC CH2 Complete Callback ID
  *          @arg @ref DAL_DAC_CH2_HALF_COMPLETE_CB_ID  DAC CH2 Half Complete Callback ID
  *          @arg @ref DAL_DAC_CH2_ERROR_ID             DAC CH2 Error Callback ID
  *          @arg @ref DAL_DAC_CH2_UNDERRUN_CB_ID       DAC CH2 UnderRun Callback ID
  *          @arg @ref DAL_DAC_MSPINIT_CB_ID            DAC MSP Init Callback ID
  *          @arg @ref DAL_DAC_MSPDEINIT_CB_ID          DAC MSP DeInit Callback ID
  *
  * @param  pCallback pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_DAC_RegisterCallback(DAC_HandleTypeDef *hdac, DAL_DAC_CallbackIDTypeDef CallbackID,
                                           pDAC_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hdac);

  if (hdac->State == DAL_DAC_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_DAC_CH1_COMPLETE_CB_ID :
        hdac->ConvCpltCallbackCh1 = pCallback;
        break;
      case DAL_DAC_CH1_HALF_COMPLETE_CB_ID :
        hdac->ConvHalfCpltCallbackCh1 = pCallback;
        break;
      case DAL_DAC_CH1_ERROR_ID :
        hdac->ErrorCallbackCh1 = pCallback;
        break;
      case DAL_DAC_CH1_UNDERRUN_CB_ID :
        hdac->DMAUnderrunCallbackCh1 = pCallback;
        break;
#if defined(DAC_CHANNEL2_SUPPORT)
      case DAL_DAC_CH2_COMPLETE_CB_ID :
        hdac->ConvCpltCallbackCh2 = pCallback;
        break;
      case DAL_DAC_CH2_HALF_COMPLETE_CB_ID :
        hdac->ConvHalfCpltCallbackCh2 = pCallback;
        break;
      case DAL_DAC_CH2_ERROR_ID :
        hdac->ErrorCallbackCh2 = pCallback;
        break;
      case DAL_DAC_CH2_UNDERRUN_CB_ID :
        hdac->DMAUnderrunCallbackCh2 = pCallback;
        break;
#endif /* DAC_CHANNEL2_SUPPORT */
      case DAL_DAC_MSPINIT_CB_ID :
        hdac->MspInitCallback = pCallback;
        break;
      case DAL_DAC_MSPDEINIT_CB_ID :
        hdac->MspDeInitCallback = pCallback;
        break;
      default :
        /* Update the error code */
        hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hdac->State == DAL_DAC_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_DAC_MSPINIT_CB_ID :
        hdac->MspInitCallback = pCallback;
        break;
      case DAL_DAC_MSPDEINIT_CB_ID :
        hdac->MspDeInitCallback = pCallback;
        break;
      default :
        /* Update the error code */
        hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hdac);
  return status;
}

/**
  * @brief  Unregister a User DAC Callback
  *         DAC Callback is redirected to the weak (surcharged) predefined callback
  * @param  hdac DAC handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_DAC_CH1_COMPLETE_CB_ID          DAC CH1 transfer Complete Callback ID
  *          @arg @ref DAL_DAC_CH1_HALF_COMPLETE_CB_ID     DAC CH1 Half Complete Callback ID
  *          @arg @ref DAL_DAC_CH1_ERROR_ID                DAC CH1 Error Callback ID
  *          @arg @ref DAL_DAC_CH1_UNDERRUN_CB_ID          DAC CH1 UnderRun Callback ID
  *          @arg @ref DAL_DAC_CH2_COMPLETE_CB_ID          DAC CH2 Complete Callback ID
  *          @arg @ref DAL_DAC_CH2_HALF_COMPLETE_CB_ID     DAC CH2 Half Complete Callback ID
  *          @arg @ref DAL_DAC_CH2_ERROR_ID                DAC CH2 Error Callback ID
  *          @arg @ref DAL_DAC_CH2_UNDERRUN_CB_ID          DAC CH2 UnderRun Callback ID
  *          @arg @ref DAL_DAC_MSPINIT_CB_ID               DAC MSP Init Callback ID
  *          @arg @ref DAL_DAC_MSPDEINIT_CB_ID             DAC MSP DeInit Callback ID
  *          @arg @ref DAL_DAC_ALL_CB_ID                   DAC All callbacks
  * @retval status
  */
DAL_StatusTypeDef DAL_DAC_UnRegisterCallback(DAC_HandleTypeDef *hdac, DAL_DAC_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hdac);

