betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dac.c
  if (hdac->State == DAL_DAC_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_DAC_CH1_COMPLETE_CB_ID :
        hdac->ConvCpltCallbackCh1 = DAL_DAC_ConvCpltCallbackCh1;
        break;
      case DAL_DAC_CH1_HALF_COMPLETE_CB_ID :
        hdac->ConvHalfCpltCallbackCh1 = DAL_DAC_ConvHalfCpltCallbackCh1;
        break;
      case DAL_DAC_CH1_ERROR_ID :
        hdac->ErrorCallbackCh1 = DAL_DAC_ErrorCallbackCh1;
        break;
      case DAL_DAC_CH1_UNDERRUN_CB_ID :
        hdac->DMAUnderrunCallbackCh1 = DAL_DAC_DMAUnderrunCallbackCh1;
        break;
#if defined(DAC_CHANNEL2_SUPPORT)
      case DAL_DAC_CH2_COMPLETE_CB_ID :
        hdac->ConvCpltCallbackCh2 = DAL_DACEx_ConvCpltCallbackCh2;
        break;
      case DAL_DAC_CH2_HALF_COMPLETE_CB_ID :
        hdac->ConvHalfCpltCallbackCh2 = DAL_DACEx_ConvHalfCpltCallbackCh2;
        break;
      case DAL_DAC_CH2_ERROR_ID :
        hdac->ErrorCallbackCh2 = DAL_DACEx_ErrorCallbackCh2;
        break;
      case DAL_DAC_CH2_UNDERRUN_CB_ID :
        hdac->DMAUnderrunCallbackCh2 = DAL_DACEx_DMAUnderrunCallbackCh2;
        break;
#endif /* DAC_CHANNEL2_SUPPORT */
      case DAL_DAC_MSPINIT_CB_ID :
        hdac->MspInitCallback = DAL_DAC_MspInit;
        break;
      case DAL_DAC_MSPDEINIT_CB_ID :
        hdac->MspDeInitCallback = DAL_DAC_MspDeInit;
        break;
      case DAL_DAC_ALL_CB_ID :
        hdac->ConvCpltCallbackCh1 = DAL_DAC_ConvCpltCallbackCh1;
        hdac->ConvHalfCpltCallbackCh1 = DAL_DAC_ConvHalfCpltCallbackCh1;
        hdac->ErrorCallbackCh1 = DAL_DAC_ErrorCallbackCh1;
        hdac->DMAUnderrunCallbackCh1 = DAL_DAC_DMAUnderrunCallbackCh1;
#if defined(DAC_CHANNEL2_SUPPORT)
        hdac->ConvCpltCallbackCh2 = DAL_DACEx_ConvCpltCallbackCh2;
        hdac->ConvHalfCpltCallbackCh2 = DAL_DACEx_ConvHalfCpltCallbackCh2;
        hdac->ErrorCallbackCh2 = DAL_DACEx_ErrorCallbackCh2;
        hdac->DMAUnderrunCallbackCh2 = DAL_DACEx_DMAUnderrunCallbackCh2;
#endif /* DAC_CHANNEL2_SUPPORT */
        hdac->MspInitCallback = DAL_DAC_MspInit;
        hdac->MspDeInitCallback = DAL_DAC_MspDeInit;
        break;
      default :
        /* Update the error code */
        hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hdac->State == DAL_DAC_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_DAC_MSPINIT_CB_ID :
        hdac->MspInitCallback = DAL_DAC_MspInit;
        break;
      case DAL_DAC_MSPDEINIT_CB_ID :
        hdac->MspDeInitCallback = DAL_DAC_MspDeInit;
        break;
      default :
        /* Update the error code */
        hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hdac->ErrorCode |= DAL_DAC_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hdac);
  return status;
}
#endif /* USE_DAL_DAC_REGISTER_CALLBACKS */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup DAC_Private_Functions
  * @{
  */

/**
  * @brief  DMA conversion complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
void DAC_DMAConvCpltCh1(DMA_HandleTypeDef *hdma)
{
  DAC_HandleTypeDef *hdac = (DAC_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_DAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->ConvCpltCallbackCh1(hdac);
#else
  DAL_DAC_ConvCpltCallbackCh1(hdac);
#endif /* USE_DAL_DAC_REGISTER_CALLBACKS */

  hdac->State = DAL_DAC_STATE_READY;
}

/**
  * @brief  DMA half transfer complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
void DAC_DMAHalfConvCpltCh1(DMA_HandleTypeDef *hdma)
{
  DAC_HandleTypeDef *hdac = (DAC_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
  /* Conversion complete callback */
#if (USE_DAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->ConvHalfCpltCallbackCh1(hdac);
#else
  DAL_DAC_ConvHalfCpltCallbackCh1(hdac);
#endif  /* USE_DAL_DAC_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA error callback
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
void DAC_DMAErrorCh1(DMA_HandleTypeDef *hdma)
{
  DAC_HandleTypeDef *hdac = (DAC_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  /* Set DAC error code to DMA error */
  hdac->ErrorCode |= DAL_DAC_ERROR_DMA;

#if (USE_DAL_DAC_REGISTER_CALLBACKS == 1)
  hdac->ErrorCallbackCh1(hdac);
#else
  DAL_DAC_ErrorCallbackCh1(hdac);
#endif /* USE_DAL_DAC_REGISTER_CALLBACKS */

  hdac->State = DAL_DAC_STATE_READY;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* DAC */

#endif /* DAL_DAC_MODULE_ENABLED */

/**
  * @}
  */

